; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	image0 - mode
	spectrograph2 - mode
	image1 - mode
	GroundStation1 - direction
	Star2 - direction
	Star4 - direction
	Star6 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star0 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument1 spectrograph2)
	(supports instrument1 image0)
	(supports instrument1 image1)
	(calibration_target instrument1 Star6)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation5)
	(supports instrument2 spectrograph2)
	(supports instrument2 image1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star0)
	(supports instrument3 image1)
	(supports instrument3 spectrograph2)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star10)
	(supports instrument4 image0)
	(supports instrument4 spectrograph2)
	(calibration_target instrument4 Star0)
	(supports instrument5 image1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star0)
	(calibration_target instrument5 GroundStation5)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite0 Star6)
	(pointing satellite3 GroundStation3)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 spectrograph2)
	(have_image Planet9 spectrograph2)
	(have_image Star10 image0)
	(have_image Star11 image1)
))

)

; plan
1. (turn_to satellite3 groundstation3 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 groundstation3)
   goals met: 1 of 7
2. (turn_to satellite1 star6 groundstation5)
   deleted: (pointing satellite1 groundstation5)
   added: (pointing satellite1 star6)
   goals met: 1 of 7
3. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 1 of 7
4. (calibrate satellite1 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 1 of 7
5. (turn_to satellite1 phenomenon8 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 phenomenon8)
   goals met: 1 of 7
6. (take_image satellite1 phenomenon8 instrument1 spectrograph2)
   added: (have_image phenomenon8 spectrograph2)
   goals met: 2 of 7
7. (turn_to satellite1 phenomenon7 phenomenon8)
   deleted: (pointing satellite1 phenomenon8)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 7
8. (turn_to satellite0 star6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star6)
   goals met: 3 of 7
9. (take_image satellite1 phenomenon7 instrument1 image1)
   added: (have_image phenomenon7 image1)
   goals met: 4 of 7
10. (turn_to satellite1 planet9 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet9)
   goals met: 4 of 7
11. (take_image satellite1 planet9 instrument1 spectrograph2)
   added: (have_image planet9 spectrograph2)
   goals met: 5 of 7
12. (turn_to satellite1 star10 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star10)
   goals met: 5 of 7
13. (take_image satellite1 star10 instrument1 image0)
   added: (have_image star10 image0)
   goals met: 6 of 7
14. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 6 of 7
15. (take_image satellite1 star11 instrument1 image1)
   added: (have_image star11 image1)
   goals met: 7 of 7
